cozycactus/sdr-widget/ports/same70-xplained/main.c
#include "types.h"
#include "same70_audio_hw.h"
#include "same70_clock.h"
#include "same70_cs4272_control.h"
#include "same70_usb.h"

#define REG32(addr) (*(volatile uint32_t *)(addr))

#define PMC_PCER0 REG32(0x400E0610u)
#define WDT_MR    REG32(0x400E1854u)

#define MATRIX_CCFG_SYSIO REG32(0x40088114u)

#define PIOA_BASE 0x400E0E00u
#define PIOB_BASE 0x400E1000u
#define PIOC_BASE 0x400E1200u

#define PIO_PER(base)      REG32((base) + 0x0000u)
#define PIO_PDR(base)      REG32((base) + 0x0004u)
#define PIO_OER(base)      REG32((base) + 0x0010u)
#define PIO_PUER(base)     REG32((base) + 0x0064u)
#define PIO_ABCDSR1(base)  REG32((base) + 0x0070u)
#define PIO_ABCDSR2(base)  REG32((base) + 0x0074u)
#define PIO_SODR(base)     REG32((base) + 0x0030u)
#define PIO_CODR(base)     REG32((base) + 0x0034u)

#define USART1_BASE 0x40028000u
#define US_CR       REG32(USART1_BASE + 0x0000u)
#define US_MR       REG32(USART1_BASE + 0x0004u)
#define US_IER      REG32(USART1_BASE + 0x0008u)
#define US_IDR      REG32(USART1_BASE + 0x000Cu)
#define US_CSR      REG32(USART1_BASE + 0x0014u)
#define US_RHR      REG32(USART1_BASE + 0x0018u)
#define US_THR      REG32(USART1_BASE + 0x001Cu)
#define US_BRGR     REG32(USART1_BASE + 0x0020u)

#define NVIC_ISER0  REG32(0xE000E100u)
#define NVIC_ICPR0  REG32(0xE000E280u)

#define SYST_CSR    REG32(0xE000E010u)
#define SYST_RVR    REG32(0xE000E014u)
#define SYST_CVR    REG32(0xE000E018u)

#define ID_PIOA     10u
#define ID_PIOB     11u
#define ID_PIOC     12u
#define ID_USART1   14u

#define LED0_PC8    (1u << 8)
#define RXD1_PA21   (1u << 21)
#define TXD1_PB4    (1u << 4)

#define SYSIO_PB4   (1u << 4)

#define WDT_WDDIS   (1u << 15)

#define US_CR_RSTRX (1u << 2)
#define US_CR_RSTTX (1u << 3)
#define US_CR_RXEN  (1u << 4)
#define US_CR_RXDIS (1u << 5)
#define US_CR_TXEN  (1u << 6)
#define US_CR_TXDIS (1u << 7)
#define US_CR_RSTSTA (1u << 8)

#define US_MR_USART_MODE_NORMAL (0u << 0)
#define US_MR_USCLKS_MCK        (0u << 4)
#define US_MR_CHRL_8_BIT        (3u << 6)
#define US_MR_PAR_NO            (4u << 9)
#define US_MR_NBSTOP_1_BIT      (0u << 12)
#define US_MR_CHMODE_NORMAL     (0u << 14)

#define US_CSR_RXRDY  (1u << 0)
#define US_CSR_TXRDY  (1u << 1)
#define US_CSR_OVRE   (1u << 5)
#define US_CSR_FRAME  (1u << 6)
#define US_CSR_PARE   (1u << 7)

#define USART_BAUD_DIV_9600 ((SAME70_MASTER_CLOCK_HZ + 76800u) / 153600u)
#define SYSTICK_HZ 1000u
#define CONSOLE_LINE_MAX 32u
#define RX_RING_SIZE 64u

static void usart1_drain_rx(void);
static void console_poll(void);
static void console_write_hex_field(const char *name, uint32_t value);
static void console_clock_status(void);
static void console_audio_out_diag(void);
static void console_audio_in_diag(void);
static void console_audio_hardware_status(void);
static void console_audio_codec_status(void);
static void console_audio_control_status(void);
static void console_audio_source_name(uint32_t source);
static void console_audio_format_name(uint32_t format);

static volatile uint32_t system_ms;
static uint32_t tick_count;
static char rx_ring[RX_RING_SIZE];
static volatile uint32_t rx_head;
static volatile uint32_t rx_tail;
static char console_line[CONSOLE_LINE_MAX];
static uint32_t console_line_len;

static void led_init(void)
{
	PIO_PER(PIOC_BASE) = LED0_PC8;
	PIO_OER(PIOC_BASE) = LED0_PC8;
	PIO_SODR(PIOC_BASE) = LED0_PC8;
}

static void led_on(void)
{
	PIO_CODR(PIOC_BASE) = LED0_PC8;
}

static void led_off(void)
{
	PIO_SODR(PIOC_BASE) = LED0_PC8;
}

static void systick_init(void)
{
	SYST_RVR = (SAME70_CPU_CLOCK_HZ / SYSTICK_HZ) - 1u;
	SYST_CVR = 0u;
	SYST_CSR = 0x7u;
}

static void usart1_init(void)
{
	PMC_PCER0 = (1u << ID_PIOA) | (1u << ID_PIOB) | (1u << ID_USART1);

	/* PB4 resets as JTAG TDI; select the normal PB4 pin before TXD1 muxing. */
	MATRIX_CCFG_SYSIO |= SYSIO_PB4;

	/* PA21 is RXD1 on peripheral A; PB4 is TXD1 on peripheral D. */
	PIO_ABCDSR1(PIOA_BASE) &= ~RXD1_PA21;
	PIO_ABCDSR2(PIOA_BASE) &= ~RXD1_PA21;
	PIO_PDR(PIOA_BASE) = RXD1_PA21;
	PIO_PUER(PIOA_BASE) = RXD1_PA21;

	PIO_ABCDSR1(PIOB_BASE) |= TXD1_PB4;
	PIO_ABCDSR2(PIOB_BASE) |= TXD1_PB4;
	PIO_PDR(PIOB_BASE) = TXD1_PB4;

	US_CR = US_CR_RXDIS | US_CR_TXDIS | US_CR_RSTRX | US_CR_RSTTX | US_CR_RSTSTA;
	US_IDR = 0xffffffffu;
	(void)US_RHR;

	US_MR = US_MR_USART_MODE_NORMAL |
		US_MR_USCLKS_MCK |
		US_MR_CHRL_8_BIT |
		US_MR_PAR_NO |
		US_MR_NBSTOP_1_BIT |
		US_MR_CHMODE_NORMAL;
	US_BRGR = USART_BAUD_DIV_9600;
	US_CR = US_CR_RXEN | US_CR_TXEN;
	NVIC_ICPR0 = (1u << ID_USART1);
	NVIC_ISER0 = (1u << ID_USART1);
	US_IER = US_CSR_RXRDY | US_CSR_OVRE | US_CSR_FRAME | US_CSR_PARE;
}

static void usart1_putc(char c)
{
	while ((US_CSR & US_CSR_TXRDY) == 0u) {
	}
	US_THR = (uint32_t)c;
}

static void usart1_write(const char *text)
{
	while (*text != '\0') {
		usart1_putc(*text++);
	}
}

static void usart1_write_u32(uint32_t value)
{
	char digits[10];
	uint32_t index = 0;

	if (value == 0u) {
		usart1_putc('0');
		return;
	}

	while (value != 0u) {
		digits[index++] = (char)('0' + (value % 10u));
		value /= 10u;
	}

	while (index != 0u) {
		usart1_putc(digits[--index]);
	}
}

static void usart1_write_hex32(uint32_t value)
{
	uint32_t index;

	usart1_write("0x");
	for (index = 0u; index < 8u; index++) {
		uint32_t shift = 28u - (index * 4u);
		uint32_t nibble = (value >> shift) & 0xfu;
		usart1_putc((char)((nibble < 10u) ? ('0' + nibble) : ('a' + (nibble - 10u))));
	}
}

static void usart1_write_hex8(uint32_t value)
{
	uint32_t index;

	for (index = 0u; index < 2u; index++) {
		uint32_t shift = 4u - (index * 4u);
		uint32_t nibble = (value >> shift) & 0xfu;
		usart1_putc((char)((nibble < 10u) ? ('0' + nibble) : ('a' + (nibble - 10u))));
	}
}

static uint32_t text_equals(const char *a, const char *b)
{
	while ((*a != '\0') && (*b != '\0')) {
		if (*a++ != *b++) {
			return 0u;
		}
	}

	return (*a == '\0') && (*b == '\0');
}

static void console_write_hex_field(const char *name, uint32_t value)
{
	usart1_write(name);
	usart1_write("=");
	usart1_write_hex32(value);
	usart1_write(" ");
}

static void console_usb_status(void)
{
	same70_usb_status_t status;

