cozycactus/sdr-widget/ports/same70-xplained/main.c
	same70_usb_get_status(&status);
	usart1_write("usb init=");
	usart1_write_u32(status.initialized);
	usart1_write(" attached=");
	usart1_write_u32(status.attached);
	usart1_write("\r\n");
	console_write_hex_field("pmc_sr", status.pmc_sr);
	console_write_hex_field("pmc_usb", status.pmc_usb);
	console_write_hex_field("pcsr1", status.pmc_pcsr1);
	usart1_write("\r\n");
	console_write_hex_field("ctrl", status.usbhs_ctrl);
	console_write_hex_field("sr", status.usbhs_sr);
	console_write_hex_field("devctrl", status.devctrl);
	usart1_write("\r\n");
	console_write_hex_field("devisr", status.devisr);
	console_write_hex_field("devept", status.devept);
	usart1_write("\r\n");
	console_write_hex_field("ep0cfg", status.ep0cfg);
	console_write_hex_field("ep0isr", status.ep0isr);
	console_write_hex_field("ep0imr", status.ep0imr);
	usart1_write("\r\n");
	console_write_hex_field("ep3cfg", status.ep3cfg);
	console_write_hex_field("ep3isr", status.ep3isr);
	usart1_write("\r\n");
	console_write_hex_field("ep4cfg", status.ep4cfg);
	console_write_hex_field("ep4isr", status.ep4isr);
	usart1_write("\r\n");
	console_write_hex_field("ep5cfg", status.ep5cfg);
	console_write_hex_field("ep5isr", status.ep5isr);
	usart1_write("\r\n");
	usart1_write("events reset=");
	usart1_write_u32(status.reset_count);
	usart1_write(" setup=");
	usart1_write_u32(status.setup_count);
	usart1_write(" tx=");
	usart1_write_u32(status.tx_count);
	usart1_write(" rxout=");
	usart1_write_u32(status.rxout_count);
	usart1_write(" stall=");
	usart1_write_u32(status.stall_count);
	usart1_write("\r\n");
	usart1_write("ctrl address=");
	usart1_write_u32(status.address);
	usart1_write(" config=");
	usart1_write_u32(status.configuration);
	usart1_write(" ep0_state=");
	usart1_write_u32(status.ep0_state);
	usart1_write(" desc=");
	usart1_write_u32(status.descriptor_count);
	usart1_write(" set_addr=");
	usart1_write_u32(status.set_address_count);
	usart1_write(" set_cfg=");
	usart1_write_u32(status.set_configuration_count);
	usart1_write(" set_int=");
	usart1_write_u32(status.set_interface_count);
	usart1_write(" alt=");
	usart1_write_hex32(status.interface_alternate_mask);
	usart1_write(" peak_alt=");
	usart1_write_hex32(status.interface_alternate_peak_mask);
	usart1_write(" last_int=");
	usart1_write_u32(status.last_set_interface_index);
	usart1_write(":");
	usart1_write_u32(status.last_set_interface_value);
	usart1_write("\r\n");
	usart1_write("audio cfg=");
	usart1_write_u32(status.audio_config_count);
	usart1_write(" set_int=");
	usart1_write_u32(status.audio_set_interface_count);
	usart1_write(" cfgok=");
	usart1_write_hex32(status.audio_cfgok_mask);
	usart1_write(" out=");
	usart1_write_u32(status.audio_out_count);
	usart1_write("/");
	usart1_write_u32(status.audio_out_bytes);
	usart1_write(" fb=");
	usart1_write_u32(status.audio_feedback_count);
	usart1_write("/");
	usart1_write_u32(status.audio_feedback_bytes);
	usart1_write(" in=");
	usart1_write_u32(status.audio_in_count);
	usart1_write("/");
	usart1_write_u32(status.audio_in_bytes);
	usart1_write(" err=");
	usart1_write_u32(status.audio_error_count);
	usart1_write("\r\n");
	usart1_write("audio last_out=");
	usart1_write_u32(status.audio_out_last_bytes);
	usart1_write(" max_out=");
	usart1_write_u32(status.audio_out_max_bytes);
	usart1_write(" outnz=");
	usart1_write_u32(status.audio_out_nonzero_bytes);
	usart1_write(" short=");
	usart1_write_u32(status.audio_short_count);
	usart1_write(" crc=");
	usart1_write_u32(status.audio_crc_count);
	usart1_write(" over=");
	usart1_write_u32(status.audio_overflow_count);
	usart1_write(" under=");
	usart1_write_u32(status.audio_underflow_count);
	usart1_write(" fb_busy=");
	usart1_write_u32(status.audio_feedback_busy_last);
	usart1_write("/");
	usart1_write_u32(status.audio_feedback_busy_max);
	usart1_write(" in_busy=");
	usart1_write_u32(status.audio_in_busy_last);
	usart1_write("/");
	usart1_write_u32(status.audio_in_busy_max);
	usart1_write("\r\n");
	usart1_write("audio loop=");
	usart1_write_u32(status.audio_loopback_level);
	usart1_write("/");
	usart1_write_u32(status.audio_loopback_peak);
	usart1_write(" drop=");
	usart1_write_u32(status.audio_loopback_drop_bytes);
	usart1_write(" silence=");
	usart1_write_u32(status.audio_loopback_silence_bytes);
	usart1_write(" source=");
	console_audio_source_name(status.audio_source_mode);
	usart1_write(" fmt=");
	console_audio_format_name(status.audio_out_format);
	usart1_write("/");
	console_audio_format_name(status.audio_in_format);
	usart1_write("\r\n");
	usart1_write("feature store loaded=");
	usart1_write_u32(status.feature_store_loaded);
	usart1_write(" valid=");
	usart1_write_u32(status.feature_store_valid);
	usart1_write(" writes=");
	usart1_write_u32(status.feature_store_write_count);
	usart1_write(" err=");
	usart1_write_u32(status.feature_store_error_count);
	usart1_write(" fsr=");
	usart1_write_hex32(status.feature_store_last_fsr);
	usart1_write("\r\n");
	console_write_hex_field("last", status.last_setup0);
	console_write_hex_field("wValue", status.last_wvalue);
	console_write_hex_field("wIndex", status.last_windex);
	console_write_hex_field("wLength", status.last_wlength);
	usart1_write("\r\n");
}

static void console_audio_source_name(uint32_t source)
{
	if (source == SAME70_USB_AUDIO_SOURCE_PATTERN) {
		usart1_write("pattern");
	} else if (source == SAME70_USB_AUDIO_SOURCE_SILENCE) {
		usart1_write("silence");
	} else if (source == SAME70_USB_AUDIO_SOURCE_TONE) {
		usart1_write("tone");
	} else if (source == SAME70_USB_AUDIO_SOURCE_SINE) {
		usart1_write("sine");
	} else if (source == SAME70_USB_AUDIO_SOURCE_MELODY) {
		usart1_write("melody");
	} else {
		usart1_write("loop");
	}
}

static void console_audio_source_status(uint32_t source)
{
	usart1_write("audio source=");
	console_audio_source_name(source);
	usart1_write("\r\n");
}

static void console_audio_control_status(void)
{
	same70_usb_status_t status;

	same70_usb_get_status(&status);
	usart1_write("audio ctl mic_mute=");
	usart1_write_u32(status.audio_mic_mute);
	usart1_write(" spk_mute=");
	usart1_write_u32(status.audio_spk_mute);
	usart1_write(" mic_vol=");
	usart1_write_hex32(status.audio_mic_volume_left);
	usart1_write("/");
	usart1_write_hex32(status.audio_mic_volume_right);
	usart1_write(" spk_vol=");
	usart1_write_hex32(status.audio_spk_volume_left);
	usart1_write("/");
	usart1_write_hex32(status.audio_spk_volume_right);
	usart1_write("\r\n");
}

static void console_audio_hardware_status(void)
{
	same70_audio_hw_status_t status;

	same70_audio_hw_get_status(&status);
	usart1_write("audio hw usb_path=");
	usart1_write_u32(status.usb_path);
	usart1_write(" external_codec=");
	usart1_write_u32(status.external_codec);
	usart1_write(" i2sc=");
	usart1_write(status.i2sc_configured != 0u ? "configured" : "not_configured");
	usart1_write("\r\n");
	usart1_write("audio hw current=");
	usart1_write(status.current_path);
	usart1_write(" ");
	usart1_write(status.adc_path);
	usart1_write(" ");
	usart1_write(status.dac_path);
	usart1_write("\r\n");
	usart1_write("audio hw candidate=");
	usart1_write(status.candidate_bus);
	usart1_write(" pins=");
	usart1_write(status.candidate_pins);
	usart1_write("\r\n");
	usart1_write("audio hw headers=");
	usart1_write(status.candidate_headers);
	usart1_write(" voltage=");
	usart1_write(status.voltage_plan);
	usart1_write("\r\n");
	usart1_write("audio hw plan=");
	usart1_write(status.clock_plan);
	usart1_write(" ");
	usart1_write(status.sample_frame);
	usart1_write(" ");
	usart1_write(status.dma_plan);
	usart1_write("\r\n");
	usart1_write("audio hw doc=");
	usart1_write(status.wiring_doc);
	usart1_write("\r\n");
	usart1_write("audio hw required=");
	usart1_write(status.required_signals);
	usart1_write("\r\n");
	usart1_write("audio hw original=");
	usart1_write(status.original_codec);
	usart1_write(" ");
	usart1_write(status.original_transport);
	usart1_write(" ");
	usart1_write(status.boundary);
	usart1_write("\r\n");
	usart1_write("audio hw next=");
	usart1_write(status.next_step);
	usart1_write("\r\n");
}

