cozycactus/sdr-widget/ports/same70-xplained/main.c
static void console_audio_codec_status(void)
{
	same70_cs4272_control_status_t status;
	const same70_cs4272_register_write_t *writes;
	uint32_t index;

	same70_cs4272_control_get_status(&status);
	usart1_write("audio codec enabled=");
	usart1_write_u32(status.control_enabled);
	usart1_write(" external_codec=");
	usart1_write_u32(status.external_codec);
	usart1_write(" bus_configured=");
	usart1_write_u32(status.bus_configured);
	usart1_write(" reset_configured=");
	usart1_write_u32(status.reset_configured);
	usart1_write(" addr7=0x");
	usart1_write_hex8(status.address_7bit);
	usart1_write(" twi_hz=");
	usart1_write_u32(status.twi_hz);
	usart1_write("\r\n");
	usart1_write("audio codec bus=");
	usart1_write(status.bus_plan);
	usart1_write("\r\n");
	usart1_write("audio codec rst=");
	usart1_write(status.reset_plan);
	usart1_write(" power=");
	usart1_write(status.power_plan);
	usart1_write("\r\n");
	usart1_write("audio codec sequence=");
	usart1_write(status.startup_sequence);
	usart1_write("\r\n");
	usart1_write("audio codec baseline=");
	writes = same70_cs4272_control_baseline_writes();
	for (index = 0u; index < status.baseline_write_count; index++) {
		if (index != 0u) {
			usart1_write(" ");
		}
		usart1_write("0x");
		usart1_write_hex8(writes[index].reg);
		usart1_write("=");
		if (writes[index].rate_dependent != 0u) {
			usart1_write("rate");
		} else {
			usart1_write("0x");
			usart1_write_hex8(writes[index].value);
		}
	}
	usart1_write("\r\n");
	usart1_write("audio codec ");
	usart1_write(status.mode1_table);
	usart1_write("\r\n");
	usart1_write("audio codec policy=");
	usart1_write(status.policy);
	usart1_write(" boundary=");
	usart1_write(status.boundary);
	usart1_write("\r\n");
	usart1_write("audio codec next=");
	usart1_write(status.next_step);
	usart1_write("\r\n");
}

static void console_audio_out_diag(void)
{
	same70_usb_audio_out_diag_t diag;
	uint32_t index;

	same70_usb_get_audio_out_diag(&diag);
	usart1_write("audio outdiag packets=");
	usart1_write_u32(diag.packets);
	usart1_write(" bytes=");
	usart1_write_u32(diag.bytes);
	usart1_write(" nonzero=");
	usart1_write_u32(diag.nonzero_bytes);
	usart1_write(" hash=");
	usart1_write_hex32(diag.hash);
	usart1_write(" last=");
	usart1_write_u32(diag.last_packet_bytes);
	usart1_write(" captured=");
	usart1_write_u32(diag.captured_bytes);
	usart1_write(" nz_offset=");
	if (diag.first_nonzero_offset == 0xffffffffu) {
		usart1_write("none");
	} else {
		usart1_write_u32(diag.first_nonzero_offset);
	}
	usart1_write(" nz_captured=");
	usart1_write_u32(diag.captured_nonzero_bytes);
	usart1_write("\r\n");
	usart1_write("audio outdiag first=");
	for (index = 0u; index < diag.captured_bytes; index++) {
		usart1_write_hex8(diag.captured[index]);
	}
	usart1_write("\r\n");
	usart1_write("audio outdiag firstnz=");
	for (index = 0u; index < diag.captured_nonzero_bytes; index++) {
		usart1_write_hex8(diag.captured_nonzero[index]);
	}
	usart1_write("\r\n");
}

static void console_audio_in_diag(void)
{
	same70_usb_audio_out_diag_t diag;
	uint32_t index;

	same70_usb_get_audio_in_diag(&diag);
	usart1_write("audio indiag packets=");
	usart1_write_u32(diag.packets);
	usart1_write(" bytes=");
	usart1_write_u32(diag.bytes);
	usart1_write(" nonzero=");
	usart1_write_u32(diag.nonzero_bytes);
	usart1_write(" hash=");
	usart1_write_hex32(diag.hash);
	usart1_write(" last=");
	usart1_write_u32(diag.last_packet_bytes);
	usart1_write(" captured=");
	usart1_write_u32(diag.captured_bytes);
	usart1_write(" nz_offset=");
	if (diag.first_nonzero_offset == 0xffffffffu) {
		usart1_write("none");
	} else {
		usart1_write_u32(diag.first_nonzero_offset);
	}
	usart1_write(" nz_captured=");
	usart1_write_u32(diag.captured_nonzero_bytes);
	usart1_write("\r\n");
	usart1_write("audio indiag first=");
	for (index = 0u; index < diag.captured_bytes; index++) {
		usart1_write_hex8(diag.captured[index]);
	}
	usart1_write("\r\n");
	usart1_write("audio indiag firstnz=");
	for (index = 0u; index < diag.captured_nonzero_bytes; index++) {
		usart1_write_hex8(diag.captured_nonzero[index]);
	}
	usart1_write("\r\n");
}

static void console_audio_format_name(uint32_t format)
{
	if (format == SAME70_USB_AUDIO_FORMAT_44K16) {
		usart1_write("44k16");
	} else {
		usart1_write("48k24");
	}
}

static void console_clock_status(void)
{
	same70_clock_status_t status;

	same70_clock_get_status(&status);
	console_write_hex_field("mor", status.ckgr_mor);
	console_write_hex_field("pllar", status.ckgr_pllar);
	console_write_hex_field("mckr", status.pmc_mckr);
	usart1_write("\r\n");
	console_write_hex_field("uckr", status.ckgr_uckr);
	console_write_hex_field("pmc_usb", status.pmc_usb);
	console_write_hex_field("scsr", status.pmc_scsr);
	console_write_hex_field("sr", status.pmc_sr);
	usart1_write("\r\n");
	console_write_hex_field("utmi", status.utmi_cktrim);
	console_write_hex_field("efc_fmr", status.efc_fmr);
	usart1_write("\r\n");
}

static uint32_t rx_next_index(uint32_t index)
{
	index++;
	if (index >= RX_RING_SIZE) {
		index = 0u;
	}

	return index;
}

static void rx_push(char c)
{
	uint32_t next = rx_next_index(rx_head);

	if (next != rx_tail) {
		rx_ring[rx_head] = c;
		rx_head = next;
	}
}

static uint32_t rx_pop(char *c)
{
	if (rx_tail == rx_head) {
		return 0u;
	}

	*c = rx_ring[rx_tail];
	rx_tail = rx_next_index(rx_tail);
	return 1u;
}

static void usart1_drain_rx(void)
{
	uint32_t status = US_CSR;

	while ((status & US_CSR_RXRDY) != 0u) {
		rx_push((char)(US_RHR & 0xffu));
		status = US_CSR;
	}

	if ((status & (US_CSR_OVRE | US_CSR_FRAME | US_CSR_PARE)) != 0u) {
		US_CR = US_CR_RSTSTA;
	}
}

static void console_prompt(void)
{
	usart1_write("> ");
}

static void console_handle_line(void)
{
	console_line[console_line_len] = '\0';

	if (console_line_len == 0u) {
		console_prompt();
		return;
	}

	if (text_equals(console_line, "?") || text_equals(console_line, "help")) {
		usart1_write("commands: ?, help, status, clk, usb, usb init, usb attach, usb detach, audio loop, audio pattern, audio tone, audio sine, audio melody, audio silence, audio hw, audio codec, audio ctl, audio outdiag, audio outdiag reset, audio indiag, audio indiag reset\r\n");
	} else if (text_equals(console_line, "status")) {
		usart1_write("status tick=");
		usart1_write_u32(tick_count);
		usart1_write(" uptime_ms=");
		usart1_write_u32(system_ms);
		usart1_write(" us_csr=");
		usart1_write_hex32(US_CSR);
		usart1_write("\r\n");
	} else if (text_equals(console_line, "clk")) {
		console_clock_status();
	} else if (text_equals(console_line, "usb")) {
		console_usb_status();
	} else if (text_equals(console_line, "usb init")) {
		same70_usb_init();
		console_usb_status();
	} else if (text_equals(console_line, "usb attach")) {
		same70_usb_attach();
		console_usb_status();
	} else if (text_equals(console_line, "usb detach")) {
		same70_usb_detach();
		console_usb_status();
	} else if (text_equals(console_line, "audio loop")) {
		(void)same70_usb_set_audio_source(SAME70_USB_AUDIO_SOURCE_LOOPBACK);
		console_audio_source_status(SAME70_USB_AUDIO_SOURCE_LOOPBACK);
	} else if (text_equals(console_line, "audio pattern")) {
		(void)same70_usb_set_audio_source(SAME70_USB_AUDIO_SOURCE_PATTERN);
		console_audio_source_status(SAME70_USB_AUDIO_SOURCE_PATTERN);
	} else if (text_equals(console_line, "audio tone")) {
		(void)same70_usb_set_audio_source(SAME70_USB_AUDIO_SOURCE_TONE);
		console_audio_source_status(SAME70_USB_AUDIO_SOURCE_TONE);
	} else if (text_equals(console_line, "audio sine")) {
		(void)same70_usb_set_audio_source(SAME70_USB_AUDIO_SOURCE_SINE);
		console_audio_source_status(SAME70_USB_AUDIO_SOURCE_SINE);
	} else if (text_equals(console_line, "audio melody")) {
		(void)same70_usb_set_audio_source(SAME70_USB_AUDIO_SOURCE_MELODY);
		console_audio_source_status(SAME70_USB_AUDIO_SOURCE_MELODY);
	} else if (text_equals(console_line, "audio silence")) {
		(void)same70_usb_set_audio_source(SAME70_USB_AUDIO_SOURCE_SILENCE);
		console_audio_source_status(SAME70_USB_AUDIO_SOURCE_SILENCE);
	} else if (text_equals(console_line, "audio hw")) {
		console_audio_hardware_status();
	} else if (text_equals(console_line, "audio codec")) {
		console_audio_codec_status();
	} else if (text_equals(console_line, "audio ctl")) {
		console_audio_control_status();
	} else if (text_equals(console_line, "audio outdiag")) {
		console_audio_out_diag();
	} else if (text_equals(console_line, "audio outdiag reset")) {
		same70_usb_reset_audio_out_diag();
		console_audio_out_diag();
	} else if (text_equals(console_line, "audio indiag")) {
		console_audio_in_diag();
	} else if (text_equals(console_line, "audio indiag reset")) {
		same70_usb_reset_audio_in_diag();
		console_audio_in_diag();
	} else {
		usart1_write("unknown: ");
		usart1_write(console_line);
		usart1_write("\r\n");
	}

	console_line_len = 0u;
	console_prompt();
}

static void console_receive(char c)
{
	if ((c == '\r') || (c == '\n')) {
		usart1_write("\r\n");
		console_handle_line();
		return;
	}

	if ((c == '\b') || (c == 0x7f)) {
		if (console_line_len != 0u) {
			console_line_len--;
			usart1_write("\b \b");
		}
		return;
	}

	if ((c < ' ') || (c > '~')) {
		return;
	}

	if (console_line_len < (CONSOLE_LINE_MAX - 1u)) {
		console_line[console_line_len++] = c;
		usart1_putc(c);
	}
}

static void console_poll(void)
{
	char c;

	while (rx_pop(&c) != 0u) {
		console_receive(c);
	}
}

void USART1_Handler(void)
{
	usart1_drain_rx();
}

void SysTick_Handler(void)
{
	system_ms++;
}

int main(void)
{
	uint32_t last_blink_ms;
	uint32_t led_state = 0u;

	WDT_MR = WDT_WDDIS;
	same70_clock_init();
	PMC_PCER0 = (1u << ID_PIOC);

	led_init();
	systick_init();
	usart1_init();
	usart1_write("\r\nSAME70 Xplained SDR Widget bring-up\r\n");
	usart1_write("USART1 via EDBG VCOM: 9600 8N1 status output\r\n");
	same70_usb_attach();
	usart1_write("USBHS target port auto-attach enabled\r\n");
	console_prompt();
	last_blink_ms = system_ms;

	for (;;) {
		same70_usb_poll();
		console_poll();
		if ((system_ms - last_blink_ms) >= 500u) {
			last_blink_ms = system_ms;
			if (led_state == 0u) {
				led_on();
				led_state = 1u;
			} else {
				led_off();
				led_state = 0u;
				tick_count++;
			}
		}
	}
}
